amazons3-connector-test/src/resources/artifacts/ESB/config/soapRequests/amazons3/createBucketPolicy.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.amazons3.createbucketpolicy">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:accessKeyId>AKIAIGURZM7GJ7TRO6KQ</urn:accessKeyId>
      <urn:secretAccessKey>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</urn:secretAccessKey>
      <urn:methodType>PUT</urn:methodType>
      <urn:contentType>application/json</urn:contentType>
      <urn:bucketName>imagesBucket5</urn:bucketName>
      <urn:xAmzDate>true</urn:xAmzDate>
      <urn:bucketUrl>http://s3.amazonaws.com/imagesBucket5</urn:bucketUrl>
      <urn:uriRemainder>/?policy</urn:uriRemainder>
      <urn:bucketPolicy>{
   "Version":"2012-10-17",   
   "Statement":[
      {
         "Sid":"Policy1",
         "Effect":"Allow",
         "Principal": {
         "AWS": "*"},
         "Action":["s3:GetObject"],
         "Resource":"arn:aws:s3:::imagesBucket5/*",
         "Condition":{
            "StringLike":{
               "aws:Referer":[
                  "http://www.example.com/*",
                  "http://example.com/*"
               ]
            }
         }
      }
   ]
}</urn:bucketPolicy>
   </soapenv:Body>
</soapenv:Envelope>


==============================================
Note:

Add Request Header:

Content-Type =application/xml